---
kind: property
id: P:Autodesk.Revit.DB.CurveLoopsProfile.Profile
source: html/83233527-0f1d-9cee-3c40-2d3dc74f8c91.htm
---
# Autodesk.Revit.DB.CurveLoopsProfile.Profile Property

Returns the curve loops of the profile.

## Syntax (C#)
```csharp
public CurveArrArray Profile { get; set; }
```

## Remarks
This property is used to retrieve the curve loops of profile.